# Pandas - Operations

In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[444,555,666,444],
                 'col3':['abc','def','ghi','xyz']})

In [4]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Finding unique values in DataFrame

<b> .unique() method </b>

In [5]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

<b> .nunique method for Length </b>

In [6]:
len(df['col2'].unique()) # Normally finding Length

3

In [7]:
df['col2'].nunique() # Finding Length using nunique

3

<b> counting unique data </b>

In [8]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

# Selecting Data

In [13]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

<b> Conditional Selction </b>

In [14]:
df[df['col2']>2]

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [16]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

<b> Apply Method </b><br>
We can use our custom functions to work with a DataFrame using apply method

In [17]:
def times2(x):  # Imagine we have a function
    return x*2

In [18]:
df['col1'].sum() # Normal sum inbuilt function can be applied like this

10

In [19]:
df['col1'].apply(times2) # we can use apply method for a custom function we made

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [20]:
df['col3'] # printing col3

0    abc
1    def
2    ghi
3    xyz
Name: col3, dtype: object

In [21]:
df['col3'].apply(len) # We can apply inbuilt functions also

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [24]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

If you are using a funciton once only u can pass a lambda function in apply method so there only the function will be used and this will save out time! and you also dont have to search for a function in order to apply it!

<b> Removing Columns </b>

In [26]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [29]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

<b> Note: </b><br>
This will not delete col1 permanently!, so if you want to delete it permanently you have to pass 3rd argument, "inplace=True" also in order to make the changes permanently! 

Example:- df.drop('col1', axis=1, inplace=True)

In [31]:
df.columns # Printing column names

Index(['col1', 'col2', 'col3'], dtype='object')

In [32]:
df.index # printing index names

RangeIndex(start=0, stop=4, step=1)

# Sorting and Ordering DataFrame

In [33]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Lets say we need to sort the df according to the col2:

In [34]:
df.sort_values('col2') # Sorting by 'col2'

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

If you want to find Null values in your df:

In [35]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Pandas Pivot Table

In [37]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
       'B':['one','one','one','two','two','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [38]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  one  x  2
3  bar  two  y  5
4  bar  two  x  4
5  bar  one  y  1

In [39]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  NaN  1.0
    two  4.0  5.0
foo one  1.5  3.0